app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(username: user_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'lau' LIMIT 1