app/controllers/tweets_controller.rb

  def create
    @tweet = current_user.tweets.new(tweet_params)
    #@tweet = Tweet.new(tweet_params)
    #@tweet.user = @user

      if @tweet.save
---
INSERT INTO "tweets" ("attachment", "created_at", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["attachment", "qwewe"], ["created_at", Tue, 02 Sep 2014 01:00:09 UTC +00:00], ["text", "ese tweet"], ["updated_at", Tue, 02 Sep 2014 01:00:09 UTC +00:00], ["user_id", 2]]